In [1]:
pip install yfinance

Requirement already satisfied: yfinance in c:\users\charbelnehme\anaconda3\envs\dev\envs\pyvizenv\lib\site-packages (0.1.70)
Requirement already satisfied: requests>=2.26 in c:\users\charbelnehme\anaconda3\envs\dev\envs\pyvizenv\lib\site-packages (from yfinance) (2.27.1)
Requirement already satisfied: lxml>=4.5.1 in c:\users\charbelnehme\anaconda3\envs\dev\envs\pyvizenv\lib\site-packages (from yfinance) (4.7.1)
Requirement already satisfied: numpy>=1.15 in c:\users\charbelnehme\anaconda3\envs\dev\envs\pyvizenv\lib\site-packages (from yfinance) (1.19.0)
Requirement already satisfied: pandas>=0.24.0 in c:\users\charbelnehme\anaconda3\envs\dev\envs\pyvizenv\lib\site-packages (from yfinance) (1.3.5)
Requirement already satisfied: multitasking>=0.0.7 in c:\users\charbelnehme\anaconda3\envs\dev\envs\pyvizenv\lib\site-packages (from yfinance) (0.0.10)
Requirement already satisfied: pytz>=2017.3 in c:\users\charbelnehme\anaconda3\envs\dev\envs\pyvizenv\lib\site-packages (from pandas>=0.24.0->yfinance) (2021.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\charbelnehme\anaconda3\envs\dev\envs\pyvizenv\lib\site-packages (from pandas>=0.24.0->yfinance) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\charbelnehme\anaconda3\envs\dev\envs\pyvizenv\lib\site-packages (from python-dateutil>=2.7.3->pandas>=0.24.0->yfinance) (1.16.0)
Requirement already satisfied: charset-normalizer~=2.0.0 in c:\users\charbelnehme\anaconda3\envs\dev\envs\pyvizenv\lib\site-packages (from requests>=2.26->yfinance) (2.0.4)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\charbelnehme\anaconda3\envs\dev\envs\pyvizenv\lib\site-packages (from requests>=2.26->yfinance) (2021.10.8)
Requirement already satisfied: idna<4,>=2.5 in c:\users\charbelnehme\anaconda3\envs\dev\envs\pyvizenv\lib\site-packages (from requests>=2.26->yfinance) (3.3)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in c:\users\charbelnehme\anaconda3\envs\dev\envs\pyvizenv\lib\site-packages (from requests>=2.26->yfinance) (1.26.8)
Note: you may need to restart the kernel to use updated packages.

In [2]:
# Import libraries
import pandas as pd
import numpy as np 
import datetime as dt
from pathlib import Path 
import seaborn as sns 
import yfinance as yf

%matplotlib inline

In [3]:
# Set tickers for US tech giants 
FB = yf.Ticker("FB")
GOOGL = yf.Ticker("GOOGL")
TSLA = yf.Ticker("TSLA")
MSFT = yf.Ticker("MSFT")

# Set tickers for high growth Australian stocks
CBA = yf.Ticker("CBA")
CSL = yf.Ticker("CSL")
BHP = yf.Ticker("BHP")
NAB = yf.Ticker("NAB")
ANZ = yf.Ticker("ANZ")
TELSTRA = yf.Ticker("TLS")
GOODMAN_GROUP = yf.Ticker("GMG")

In [4]:
# Historical stock information - ALL TIME
data = yf.download("FB GOOGL TSLA MSFT CBA CSL BHP NAB ANZ TLS GMG", period="max")
data.head()

[*********************100%***********************]  11 of 11 completed

           Adj Close                                               ... Volume  \
                 ANZ BHP CBA       CSL  FB GMG GOOGL MSFT NAB TLS  ...    BHP
Date                                                               ...
1973-02-21       NaN NaN NaN  0.361379 NaN NaN   NaN  NaN NaN NaN  ...    NaN
1973-02-22       NaN NaN NaN  0.367303 NaN NaN   NaN  NaN NaN NaN  ...    NaN
1973-02-23       NaN NaN NaN  0.365328 NaN NaN   NaN  NaN NaN NaN  ...    NaN
1973-02-26       NaN NaN NaN  0.357429 NaN NaN   NaN  NaN NaN NaN  ...    NaN
1973-02-27       NaN NaN NaN  0.355454 NaN NaN   NaN  NaN NaN NaN  ...    NaN


           CBA    CSL  FB GMG GOOGL MSFT NAB TLS TSLA
Date
1973-02-21 NaN  64000 NaN NaN   NaN  NaN NaN NaN  NaN
1973-02-22 NaN  22400 NaN NaN   NaN  NaN NaN NaN  NaN
1973-02-23 NaN  22400 NaN NaN   NaN  NaN NaN NaN  NaN
1973-02-26 NaN  51200 NaN NaN   NaN  NaN NaN NaN  NaN
1973-02-27 NaN  25600 NaN NaN   NaN  NaN NaN NaN  NaN

[5 rows x 66 columns]

In [5]:
# FY2020-21 stock information
data_FY2021 = yf.download("FB GOOGL TSLA MSFT CBA CSL BHP NAB ANZ TLS GMG", period= "ytd")
data_FY2021.head()

[*********************100%***********************]  11 of 11 completed

3 Failed downloads:
- ANZ: No data found for this date range, symbol may be delisted
- NAB: No data found for this date range, symbol may be delisted
- GMG: No data found for this date range, symbol may be delisted

           Adj Close                                               \
                 ANZ        BHP   CBA         CSL          FB GMG
Date
2022-01-03       NaN  60.340000   NaN  245.369995  338.540009 NaN
2022-01-04       NaN  61.320000  0.12  249.000000  336.529999 NaN
2022-01-05       NaN  62.049999  0.12  243.339996  324.170013 NaN
2022-01-06       NaN  62.119999  0.12  242.440002  332.459991 NaN
2022-01-07       NaN  64.360001  0.12  238.860001  331.790009 NaN

                                                ...   Volume                 \
                  GOOGL        MSFT NAB    TLS  ...      BHP    CBA     CSL
Date                                            ...
2022-01-03  2899.830078  334.750000 NaN  16.00  ...  1584400    NaN  320500
2022-01-04  2887.989990  329.010010 NaN  15.36  ...  3321300    0.0  369900
2022-01-05  2755.500000  316.380005 NaN  14.42  ...  6382600    0.0  366700
2022-01-06  2754.949951  313.880005 NaN  13.95  ...  2926300    0.0  329700
2022-01-07  2740.340088  314.040009 NaN  13.72  ...  3727400  500.0  223500


                  FB GMG    GOOGL      MSFT NAB     TLS      TSLA
Date
2022-01-03  14537900 NaN  1432300  28865100 NaN  440700  34643800
2022-01-04  15998000 NaN  1420000  32674300 NaN  381600  33416100
2022-01-05  20564500 NaN  2730900  40054300 NaN  762900  26706600
2022-01-06  27962800 NaN  1867400  39646100 NaN  812200  30112200
2022-01-07  14711400 NaN  1487700  32674000 NaN  845000  27919000

[5 rows x 66 columns]

In [6]:
# Stock info - current financial year 
data_ytd = yf.download("FB GOOGL TSLA MSFT CBA CSL BHP NAB ANZ TLS GMG", period = "ytd")
data_ytd.head()

[*********************100%***********************]  11 of 11 completed

3 Failed downloads:
- NAB: No data found for this date range, symbol may be delisted
- ANZ: No data found for this date range, symbol may be delisted
- GMG: No data found for this date range, symbol may be delisted

           Adj Close                                               \
                 ANZ        BHP   CBA         CSL          FB GMG
Date
2022-01-03       NaN  60.340000   NaN  245.369995  338.540009 NaN
2022-01-04       NaN  61.320000  0.12  249.000000  336.529999 NaN
2022-01-05       NaN  62.049999  0.12  243.339996  324.170013 NaN
2022-01-06       NaN  62.119999  0.12  242.440002  332.459991 NaN
2022-01-07       NaN  64.360001  0.12  238.860001  331.790009 NaN

                                                ...   Volume                 \
                  GOOGL        MSFT NAB    TLS  ...      BHP    CBA     CSL
Date                                            ...
2022-01-03  2899.830078  334.750000 NaN  16.00  ...  1584400    NaN  320500
2022-01-04  2887.989990  329.010010 NaN  15.36  ...  3321300    0.0  369900
2022-01-05  2755.500000  316.380005 NaN  14.42  ...  6382600    0.0  366700
2022-01-06  2754.949951  313.880005 NaN  13.95  ...  2926300    0.0  329700
2022-01-07  2740.340088  314.040009 NaN  13.72  ...  3727400  500.0  223500


                  FB GMG    GOOGL      MSFT NAB     TLS      TSLA
Date
2022-01-03  14537900 NaN  1432300  28865100 NaN  440700  34643800
2022-01-04  15998000 NaN  1420000  32674300 NaN  381600  33416100
2022-01-05  20564500 NaN  2730900  40054300 NaN  762900  26706600
2022-01-06  27962800 NaN  1867400  39646100 NaN  812200  30112200
2022-01-07  14711400 NaN  1487700  32674000 NaN  845000  27919000

[5 rows x 66 columns]

In [7]:
# FACEBOOK
# Historical stock data
hist_FB = FB.history(period="max")
hist_FB.head()

,Open,High,Low,Close,Volume,Dividends,Stock Splits
Date,,,,,,,
2012-05-18,42.049999,45.000000,38.000000,38.230000,573576400,0,0
2012-05-21,36.529999,36.660000,33.000000,34.029999,168192700,0,0
2012-05-22,32.610001,33.590000,30.940001,31.000000,101786600,0,0
2012-05-23,31.370001,32.500000,31.360001,32.000000,73600000,0,0
2012-05-24,32.950001,33.209999,31.770000,33.029999,50237200,0,0

In [8]:
# Fiancial information - Facebook
FB_financials = FB.financials
FB_financials.head()

,2021-12-31,2020-12-31,2019-12-31,2018-12-31
Research Development,24655000000.0,18447000000.0,13600000000.0,10273000000.0
Effect Of Accounting Charges,None,None,None,None
Income Before Tax,47284000000.0,33180000000.0,24812000000.0,25361000000.0
Minority Interest,None,None,None,None
Net Income,39370000000.0,29146000000.0,18485000000.0,22112000000.0

In [9]:
# Quarterly financial information - Facebook
FB_quarterly_financials = FB.quarterly_financials
FB_quarterly_financials.head()

,2021-12-31,2021-09-30,2021-06-30,2021-03-31
Research Development,7046000000.0,6316000000.0,6096000000.0,5197000000.0
Effect Of Accounting Charges,None,None,None,None
Income Before Tax,12703000000.0,10565000000.0,12513000000.0,11503000000.0
Minority Interest,None,None,None,None
Net Income,10285000000.0,9194000000.0,10394000000.0,9497000000.0

In [10]:
# Identify shareholders - Facebook 
FB_shareholders = FB.major_holders
FB_shareholders.head()

        0                                      1
0   0.62%        % of Shares Held by All Insider
1  81.47%       % of Shares Held by Institutions
2  81.98%        % of Float Held by Institutions
3    4315  Number of Institutions Holding Shares

In [11]:
# Balance sheet - Facebook
FB_balance_sheet = FB.balance_sheet
FB.balance_sheet.head()

,2021-12-31,2020-12-31,2019-12-31,2018-12-31
Intangible Assets,6.340000e+08,6.230000e+08,8.940000e+08,1.294000e+09
Capital Surplus,5.581100e+10,5.001800e+10,4.585100e+10,4.290600e+10
Total Liab,4.110800e+10,3.102600e+10,3.232200e+10,1.320700e+10
Total Stockholder Equity,1.248790e+11,1.282900e+11,1.010540e+11,8.412700e+10
Other Current Liab,1.269800e+10,1.001800e+10,1.118600e+10,4.494000e+09

In [12]:
# Quarterly balance sheet - Facebook
FB_quarterly_balance_sheet = FB.quarterly_balance_sheet
FB_quarterly_balance_sheet.head()

,2021-12-31,2021-09-30,2021-06-30,2021-03-31
Intangible Assets,6.340000e+08,3.650000e+08,5.140000e+08,5.050000e+08
Capital Surplus,5.581100e+10,5.433400e+10,5.284500e+10,5.116000e+10
Total Liab,4.110800e+10,3.622500e+10,3.238200e+10,2.986600e+10
Total Stockholder Equity,1.248790e+11,1.333600e+11,1.382270e+11,1.336570e+11
Other Current Liab,1.269800e+10,1.373000e+09,1.340000e+09,1.388000e+09

In [13]:
# Facebook earnings 
FB_earnings = FB.earnings
FB_earnings.head()

           Revenue     Earnings
Year
2018   55838000000  22112000000
2019   70697000000  18485000000
2020   85965000000  29146000000
2021  117929000000  39370000000

In [14]:
# Download dataframe
data_FB = yf.download("FB", period="max")
data_FB.head()

[*********************100%***********************]  1 of 1 completed

                 Open       High        Low      Close  Adj Close     Volume
Date
2012-05-18  42.049999  45.000000  38.000000  38.230000  38.230000  573576400
2012-05-21  36.529999  36.660000  33.000000  34.029999  34.029999  168192700
2012-05-22  32.610001  33.590000  30.940001  31.000000  31.000000  101786600
2012-05-23  31.370001  32.500000  31.360001  32.000000  32.000000   73600000
2012-05-24  32.950001  33.209999  31.770000  33.029999  33.029999   50237200

In [15]:
# Ethical Investing - Facebook
FB_sustainability = FB.sustainability
FB_sustainability.head(15)

                       Value
2022-2
palmOil                False
controversialWeapons   False
gambling               False
socialScore            21.01
nuclear                False
furLeather             False
alcoholic              False
gmo                    False
catholic               False
socialPercentile        None
peerCount                105
governanceScore        10.41
environmentPercentile   None
animalTesting          False
tobacco                False

In [16]:
# Broker Recommendation 
FB_recommendations = FB.recommendations
FB_recommendations.head()

                                Firm    To Grade From Grade Action
Date
2012-06-22 07:56:00           Nomura         Buy              init
2012-06-27 05:39:00        JP Morgan  Overweight              init
2012-06-27 05:41:00  Bank of America     Neutral              init
2012-06-27 05:44:00        Citigroup     Neutral              init
2012-06-27 05:58:00    Credit Suisse     Neutral              init

In [17]:
# GOOGLE 
# Historical stock data
hist_googl = GOOGL.history(period="max")
hist_googl.head()

,Open,High,Low,Close,Volume,Dividends,Stock Splits
Date,,,,,,,
2004-08-19,50.050049,52.082081,48.028027,50.220219,44659096,0,0.0
2004-08-20,50.555557,54.594597,50.300301,54.209209,22834343,0,0.0
2004-08-23,55.430431,56.796799,54.579578,54.754753,18256126,0,0.0
2004-08-24,55.675674,55.855858,51.836838,52.487488,15247337,0,0.0
2004-08-25,52.532532,54.054054,51.991993,53.053055,9188602,0,0.0

In [18]:
# Identify shareholders
GOOGL_shareholders = GOOGL.major_holders
GOOGL_shareholders.head()

        0                                      1
0   0.15%        % of Shares Held by All Insider
1  80.07%       % of Shares Held by Institutions
2  80.19%        % of Float Held by Institutions
3    4669  Number of Institutions Holding Shares

In [19]:
# Balance sheet
GOOGL_balance_sheet = FB.balance_sheet
GOOGL.balance_sheet.head()

,2021-12-31,2020-12-31,2019-12-31,2018-12-31
Intangible Assets,1.417000e+09,1.445000e+09,1.979000e+09,2.220000e+09
Total Liab,1.076330e+11,9.707200e+10,7.446700e+10,5.516400e+10
Total Stockholder Equity,2.516350e+11,2.225440e+11,2.014420e+11,1.776280e+11
Other Current Liab,2.920800e+10,2.800600e+10,2.215900e+10,1.761200e+10
Total Assets,3.592680e+11,3.196160e+11,2.759090e+11,2.327920e+11

In [20]:
# Quarterly balance sheet
GOOGL_quarterly_balance_sheet = GOOGL.quarterly_balance_sheet
GOOGL_quarterly_balance_sheet.head()

,2021-12-31,2021-09-30,2021-06-30,2021-03-31
Intangible Assets,1.417000e+09,1.549000e+09,1.626000e+09,1.823000e+09
Total Liab,1.076330e+11,1.028360e+11,9.782200e+10,9.708200e+10
Total Stockholder Equity,2.516350e+11,2.445670e+11,2.375650e+11,2.300130e+11
Other Current Liab,2.920800e+10,3.181400e+10,2.843600e+10,3.008700e+10
Total Assets,3.592680e+11,3.474030e+11,3.353870e+11,3.270950e+11

In [21]:
# GOOGL earnings 
GOOGL_earnings = GOOGL.earnings
GOOGL_earnings.head()

           Revenue     Earnings
Year
2018  136819000000  30736000000
2019  161857000000  34343000000
2020  182527000000  40269000000
2021  257637000000  76033000000

In [22]:
# GOOGL DataFrame 
data_GOOGL = yf.download("FB", period="max")
data_GOOGL.head()

[*********************100%***********************]  1 of 1 completed

                 Open       High        Low      Close  Adj Close     Volume
Date
2012-05-18  42.049999  45.000000  38.000000  38.230000  38.230000  573576400
2012-05-21  36.529999  36.660000  33.000000  34.029999  34.029999  168192700
2012-05-22  32.610001  33.590000  30.940001  31.000000  31.000000  101786600
2012-05-23  31.370001  32.500000  31.360001  32.000000  32.000000   73600000
2012-05-24  32.950001  33.209999  31.770000  33.029999  33.029999   50237200

In [23]:
# Ethical Investing - Google
GOOGL_sustainability = GOOGL.sustainability 
GOOGL_sustainability.head()

                      Value
2022-2
palmOil               False
controversialWeapons  False
gambling              False
socialScore           10.81
nuclear               False

In [24]:
# GOOGL Stock Recommendation 
GOOGL_recommendations = GOOGL.recommendations 
GOOGL_recommendations.head()

                                 Firm    To Grade From Grade Action
Date
2014-12-17 00:00:00  Pivotal Research         Buy                up
2015-01-08 06:03:07            Stifel        Hold        Buy   down
2015-01-14 09:00:00     Credit Suisse  Outperform              main
2015-01-30 09:00:00         Citigroup         Buy              main
2015-03-02 14:04:06   Bank of America         Buy    Neutral     up

In [25]:
# TESLA STOCK
# Historical price data
hist_TSLA = TSLA.history(period="max")
hist_TSLA.head()

             Open   High    Low  Close    Volume  Dividends  Stock Splits
Date
2010-06-29  3.800  5.000  3.508  4.778  93831500          0           0.0
2010-06-30  5.158  6.084  4.660  4.766  85935500          0           0.0
2010-07-01  5.000  5.184  4.054  4.392  41094000          0           0.0
2010-07-02  4.600  4.620  3.742  3.840  25699000          0           0.0
2010-07-06  4.000  4.000  3.166  3.222  34334500          0           0.0

In [26]:
# Tesla Financials 
TSLA_financials = TSLA.financials
TSLA_financials.head()

,2021-12-31,2020-12-31,2019-12-31,2018-12-31
Research Development,2593000000.0,1491000000.0,1343000000.0,1460000000.0
Effect Of Accounting Charges,None,None,None,None
Income Before Tax,6343000000.0,1154000000.0,-665000000.0,-1005000000.0
Minority Interest,1394000000.0,1454000000.0,1492000000.0,1390000000.0
Net Income,5519000000.0,721000000.0,-862000000.0,-976000000.0

In [27]:
# Tesla quarterly financials 
TSLA_quarterly_financials = TSLA.quarterly_financials
TSLA_quarterly_financials.head()

,2021-12-31,2021-09-30,2021-06-30,2021-03-31
Research Development,740000000.0,611000000.0,576000000.0,666000000.0
Effect Of Accounting Charges,None,None,None,None
Income Before Tax,2635000000.0,1882000000.0,1293000000.0,533000000.0
Minority Interest,1394000000.0,1441000000.0,1446000000.0,1448000000.0
Net Income,2321000000.0,1618000000.0,1142000000.0,438000000.0

In [28]:
# Tesla shareholders
TSLA_shareholders = TSLA.major_holders
TSLA_shareholders.head()

        0                                      1
0  19.39%        % of Shares Held by All Insider
1  41.54%       % of Shares Held by Institutions
2  51.54%        % of Float Held by Institutions
3    3123  Number of Institutions Holding Shares

In [29]:
# Tesla balance sheet
TSLA_balance_sheet = TSLA.balance_sheet
TSLA.balance_sheet.head()

,2021-12-31,2020-12-31,2019-12-31,2018-12-31
Intangible Assets,2.570000e+08,3.130000e+08,3.390000e+08,2.820000e+08
Capital Surplus,2.980300e+10,2.726000e+10,1.273600e+10,1.024900e+10
Total Liab,3.054800e+10,2.846900e+10,2.619900e+10,2.342700e+10
Total Stockholder Equity,3.018900e+10,2.222500e+10,6.618000e+09,4.923000e+09
Minority Interest,1.394000e+09,1.454000e+09,1.492000e+09,1.390000e+09

In [30]:
# Tesla quarterly balance sheet
TSLA_quarterly_balance_sheet = TSLA.quarterly_balance_sheet
TSLA_quarterly_balance_sheet.head()

,2021-12-31,2021-09-30,2021-06-30,2021-03-31
Intangible Assets,2.570000e+08,2.690000e+08,2.830000e+08,2.990000e+08
Capital Surplus,2.980300e+10,2.892200e+10,2.820500e+10,2.762300e+10
Total Liab,3.054800e+10,2.934000e+10,2.889600e+10,2.850700e+10
Total Stockholder Equity,3.018900e+10,2.705300e+10,2.480400e+10,2.301700e+10
Minority Interest,1.394000e+09,1.441000e+09,1.446000e+09,1.448000e+09

In [31]:
# Tesla earnings 
TSLA_earnings = FB.earnings
TSLA_earnings.head()

           Revenue     Earnings
Year
2018   55838000000  22112000000
2019   70697000000  18485000000
2020   85965000000  29146000000
2021  117929000000  39370000000

In [32]:
# Download Tesla Dataframe 
data_TSLA = yf.download("TSLA", period="max")
data_TSLA.head()

[*********************100%***********************]  1 of 1 completed

             Open   High    Low  Close  Adj Close    Volume
Date
2010-06-29  3.800  5.000  3.508  4.778      4.778  93831500
2010-06-30  5.158  6.084  4.660  4.766      4.766  85935500
2010-07-01  5.000  5.184  4.054  4.392      4.392  41094000
2010-07-02  4.600  4.620  3.742  3.840      3.840  25699000
2010-07-06  4.000  4.000  3.166  3.222      3.222  34334500

In [33]:
# Ethical investing - Tesla 
TSLA_sustainability = TSLA.sustainability
TSLA_sustainability.head(15)

                       Value
2022-2
palmOil                False
controversialWeapons   False
gambling               False
socialScore            16.16
nuclear                False
furLeather             False
alcoholic              False
gmo                    False
catholic               False
socialPercentile        None
peerCount                 37
governanceScore         9.61
environmentPercentile   None
animalTesting          False
tobacco                False

In [34]:
# Broker Recommendation 
TSLA_recommendations = TSLA.recommendations
TSLA_recommendations.head()

                            Firm    To Grade From Grade Action
Date
2012-02-16 07:42:00    JP Morgan  Overweight              main
2012-02-16 13:53:00   Wunderlich        Hold              down
2012-02-17 06:17:00   Oxen Group         Buy              init
2012-03-26 07:31:00   Wunderlich         Buy                up
2012-05-22 05:57:00  Maxim Group         Buy              init

In [35]:
# MICROSOFT
# Historical price data
hist_MSFT = MSFT.history(period="max")
hist_MSFT.head()

,Open,High,Low,Close,Volume,Dividends,Stock Splits
Date,,,,,,,
1986-03-13,0.055898,0.064119,0.055898,0.061378,1031788800,0.0,0.0
1986-03-14,0.061378,0.064667,0.061378,0.063570,308160000,0.0,0.0
1986-03-17,0.063570,0.065215,0.063570,0.064667,133171200,0.0,0.0
1986-03-18,0.064667,0.065215,0.062474,0.063022,67766400,0.0,0.0
1986-03-19,0.063022,0.063570,0.061378,0.061926,47894400,0.0,0.0

In [36]:
# Microsoft quarterly financials 
MSFT_quarterly_financials = MSFT.quarterly_financials
MSFT_quarterly_financials.head()

,2021-12-31,2021-09-30,2021-06-30,2021-03-31
Research Development,5758000000.0,5599000000.0,5687000000.0,5204000000.0
Effect Of Accounting Charges,None,None,None,None
Income Before Tax,22515000000.0,20524000000.0,19405000000.0,17236000000.0
Minority Interest,None,None,None,None
Net Income,18765000000.0,20505000000.0,16458000000.0,15457000000.0

In [37]:
# Microsoft shareholders
MSFT_shareholders = MSFT.major_holders
MSFT_shareholders.head()

        0                                      1
0   0.06%        % of Shares Held by All Insider
1  72.16%       % of Shares Held by Institutions
2  72.21%        % of Float Held by Institutions
3    5628  Number of Institutions Holding Shares

In [38]:
# Microsoft balance sheet
MSFT_balance_sheet = MSFT.balance_sheet
MSFT.balance_sheet.head()

,2021-06-30,2020-06-30,2019-06-30,2018-06-30
Intangible Assets,7.800000e+09,7.038000e+09,7.750000e+09,8.053000e+09
Total Liab,1.917910e+11,1.830070e+11,1.842260e+11,1.761300e+11
Total Stockholder Equity,1.419880e+11,1.183040e+11,1.023300e+11,8.271800e+10
Other Current Liab,5.261200e+10,4.600100e+10,4.586000e+10,3.819500e+10
Total Assets,3.337790e+11,3.013110e+11,2.865560e+11,2.588480e+11

In [39]:
# Microsoft quarterly balance sheet
MSFT_quarterly_balance_sheet = MSFT.quarterly_balance_sheet
MSFT_quarterly_balance_sheet.head()

,2021-12-31,2021-09-30,2021-06-30,2021-03-31
Intangible Assets,7.462000e+09,7.794000e+09,7.800000e+09,8.127000e+09
Total Liab,1.803790e+11,1.834400e+11,1.917910e+11,1.743740e+11
Total Stockholder Equity,1.600100e+11,1.519780e+11,1.419880e+11,1.345050e+11
Other Current Liab,4.634600e+10,5.262200e+10,5.261200e+10,4.006900e+10
Total Assets,3.403890e+11,3.354180e+11,3.337790e+11,3.088790e+11

In [41]:
# Microsoft earnings 
MSFT_earnings = MSFT.earnings
MSFT_earnings.head()

           Revenue     Earnings
Year
2018  110360000000  16571000000
2019  125843000000  39240000000
2020  143015000000  44281000000
2021  168088000000  61271000000

In [47]:
# Download Microsoft Dataframe 
data_MSFT = yf.download("MSFT", period="max")
data_MSFT.head()

[*********************100%***********************]  1 of 1 completed

                Open      High       Low     Close  Adj Close      Volume
Date
1986-03-13  0.088542  0.101563  0.088542  0.097222   0.061378  1031788800
1986-03-14  0.097222  0.102431  0.097222  0.100694   0.063570   308160000
1986-03-17  0.100694  0.103299  0.100694  0.102431   0.064667   133171200
1986-03-18  0.102431  0.103299  0.098958  0.099826   0.063022    67766400
1986-03-19  0.099826  0.100694  0.097222  0.098090   0.061926    47894400

In [49]:
# Ethical investing - Microsoft
MSFT_sustainability = MSFT.sustainability
MSFT_sustainability.head(15)

                       Value
2022-2
palmOil                False
controversialWeapons   False
gambling               False
socialScore             8.06
nuclear                False
furLeather             False
alcoholic              False
gmo                    False
catholic               False
socialPercentile        None
peerCount                105
governanceScore         4.73
environmentPercentile   None
animalTesting          False
tobacco                False

In [50]:
# Broker Recommendation 
MSFT_recommendations = MSFT.recommendations
MSFT_recommendations.head()

                               Firm       To Grade From Grade Action
Date
2012-03-16 08:19:00  Argus Research            Buy                up
2012-03-19 14:00:00  Hilliard Lyons  Long-Term Buy              main
2012-03-22 07:03:00  Morgan Stanley     Overweight              main
2012-04-03 11:53:00             UBS            Buy              main
2012-04-20 06:18:00   Deutsche Bank            Buy              main

In [51]:
# CBA
# Historical stock data
hist_CBA = CBA.history(period="max")
hist_CBA.head()

             Open   High    Low  Close  Volume  Dividends  Stock Splits
Date
2013-07-05  0.060  0.060  0.055  0.055   20000          0             0
2013-07-08  0.060  0.060  0.050  0.050   48000          0             0
2013-07-09  0.045  0.070  0.045  0.070   93000          0             0
2013-07-10  0.050  0.050  0.050  0.050   20000          0             0
2013-07-11  0.045  0.045  0.045  0.045   14000          0             0

In [53]:
# CBA financials
CBA_financials = CBA.financials
CBA_financials.head(10)

Empty DataFrame
Columns: [Open, High, Low, Close, Adj Close, Volume]
Index: []

In [54]:
# CBA quarterly financials 
CBA_quarterly_financials = CBA.quarterly_financials
CBA_quarterly_financials.head()

Empty DataFrame
Columns: [Open, High, Low, Close, Adj Close, Volume]
Index: []

In [55]:
# CBA shareholders
CBA_shareholders = CBA.major_holders
CBA_shareholders.head()

                     0   1
0       Previous Close NaN
1           YTD Return NaN
2  Expense Ratio (net) NaN
3             Category NaN
4        Last Cap Gain NaN

In [56]:
# CBA balance sheet
CBA_balance_sheet = CBA.balance_sheet
CBA.balance_sheet.head()

Empty DataFrame
Columns: [Open, High, Low, Close, Adj Close, Volume]
Index: []

In [57]:
# CBA quarterly balance sheet
CBA_quarterly_balance_sheet = CBA.quarterly_balance_sheet
CBA_quarterly_balance_sheet.head()

Empty DataFrame
Columns: [Open, High, Low, Close, Adj Close, Volume]
Index: []

In [58]:
# CBA earnings 
CBA_earnings = CBA.earnings
CBA_earnings.head()

Empty DataFrame
Columns: [Open, High, Low, Close, Adj Close, Volume]
Index: []

In [59]:
# Download CBA Dataframe 
data_CBA = yf.download("CBA", period="max")
data_CBA.head()

[*********************100%***********************]  1 of 1 completed

             Open   High    Low  Close  Adj Close  Volume
Date
2013-07-05  0.060  0.060  0.055  0.055      0.055   20000
2013-07-08  0.060  0.060  0.050  0.050      0.050   48000
2013-07-09  0.045  0.070  0.045  0.070      0.070   93000
2013-07-10  0.050  0.050  0.050  0.050      0.050   20000
2013-07-11  0.045  0.045  0.045  0.045      0.045   14000

In [62]:
# Broker Recommendation 
CBA_recommendations = TSLA.recommendations
CBA_recommendations.head()

                            Firm    To Grade From Grade Action
Date
2012-02-16 07:42:00    JP Morgan  Overweight              main
2012-02-16 13:53:00   Wunderlich        Hold              down
2012-02-17 06:17:00   Oxen Group         Buy              init
2012-03-26 07:31:00   Wunderlich         Buy                up
2012-05-22 05:57:00  Maxim Group         Buy              init

In [63]:
# CSL
# Historical stock data
hist_FB = FB.history(period="max")
hist_FB.head()

,Open,High,Low,Close,Volume,Dividends,Stock Splits
Date,,,,,,,
2012-05-18,42.049999,45.000000,38.000000,38.230000,573576400,0,0
2012-05-21,36.529999,36.660000,33.000000,34.029999,168192700,0,0
2012-05-22,32.610001,33.590000,30.940001,31.000000,101786600,0,0
2012-05-23,31.370001,32.500000,31.360001,32.000000,73600000,0,0
2012-05-24,32.950001,33.209999,31.770000,33.029999,50237200,0,0

In [64]:
# Fiancial information -CSL
CSL_financials = CSL.financials
CSL_financials.head()

,2021-12-31,2020-12-31,2019-12-31,2018-12-31
Research Development,49900000.0,54500000.0,60800000.0,55000000.0
Effect Of Accounting Charges,None,None,None,None
Income Before Tax,482500000.0,401300000.0,595300000.0,445900000.0
Minority Interest,None,None,None,None
Net Income,421700000.0,320100000.0,472800000.0,611100000.0

In [65]:
# CSL quarterly balance sheet
CSL_quarterly_balance_sheet = CSL.quarterly_balance_sheet
CSL_quarterly_balance_sheet.head()

,2021-12-31,2021-09-30,2021-06-30,2021-03-31
Total Stockholder Equity,2.544800e+09,2.544800e+09,2.417900e+09,2.411800e+09
Net Tangible Assets,-1.594100e+09,-1.594100e+09,-1.262000e+08,-3.245000e+08
Intangible Assets,NaN,1.599400e+09,9.039000e+08,1.000800e+09
Capital Surplus,NaN,4.738000e+08,4.601000e+08,4.434000e+08
Total Liab,NaN,4.529800e+09,3.421400e+09,3.340400e+09

In [66]:
# CSL earnings 
CSL_earnings = CSL.earnings
CSL_earnings.head()

         Revenue   Earnings
Year
2018  4479500000  611100000
2019  4811600000  472800000
2020  4245200000  320100000
2021  4810300000  421700000

In [67]:
# Download CSL Dataframe 
data_CSL = yf.download("CSL", period="max")
data_CSL.head()

[*********************100%***********************]  1 of 1 completed

            Open      High       Low     Close  Adj Close  Volume
Date
1973-02-21   0.0  0.722656  0.714844  0.714844   0.361379   64000
1973-02-22   0.0  0.726563  0.714844  0.726563   0.367303   22400
1973-02-23   0.0  0.726563  0.718750  0.722656   0.365328   22400
1973-02-26   0.0  0.714844  0.707031  0.707031   0.357429   51200
1973-02-27   0.0  0.707031  0.703125  0.703125   0.355455   25600

In [68]:
# Ethical investing - CSL
CSL_sustainability = CSL.sustainability
CSL_sustainability.head(15)

                       Value
2022-2
palmOil                False
controversialWeapons   False
gambling               False
socialScore             3.67
nuclear                False
furLeather             False
alcoholic              False
gmo                    False
catholic               False
socialPercentile        None
peerCount                 14
governanceScore         6.31
environmentPercentile   None
animalTesting          False
tobacco                False

In [69]:
# Broker Recommendation 
CSL_recommendations = TSLA.recommendations
CSL_recommendations.head()

                            Firm    To Grade From Grade Action
Date
2012-02-16 07:42:00    JP Morgan  Overweight              main
2012-02-16 13:53:00   Wunderlich        Hold              down
2012-02-17 06:17:00   Oxen Group         Buy              init
2012-03-26 07:31:00   Wunderlich         Buy                up
2012-05-22 05:57:00  Maxim Group         Buy              init

In [70]:
# BHP
# Historical stock data
hist_BHP = BHP.history(period="max")
hist_BHP.head()

,Open,High,Low,Close,Volume,Dividends,Stock Splits
Date,,,,,,,
1980-03-17,0.0,0.784630,0.769394,0.769394,45766,0.0,0.0
1980-03-18,0.0,0.792247,0.777012,0.777012,22080,0.0,0.0
1980-03-19,0.0,0.837954,0.822718,0.822718,9635,0.0,0.0
1980-03-20,0.0,0.830336,0.815101,0.815101,98758,0.0,0.0
1980-03-21,0.0,0.799865,0.784630,0.784630,74269,0.0,0.0

In [71]:
# Fiancial information - bhp
BHP_financials = BHP.financials
BHP_financials.head()

,2021-06-30,2020-06-30,2019-06-30,2018-06-30
Research Development,None,None,None,None
Effect Of Accounting Charges,None,None,None,None
Income Before Tax,24601000000.0,13510000000.0,15049000000.0,14751000000.0
Minority Interest,4341000000.0,4310000000.0,4584000000.0,5078000000.0
Net Income,11304000000.0,7956000000.0,8306000000.0,3705000000.0

In [72]:
# Balance sheet - BHP
BHP_balance_sheet = BHP.balance_sheet
BHP.balance_sheet.head()

,2021-06-30,2020-06-30,2019-06-30,2018-06-30
Intangible Assets,2.400000e+08,3.770000e+08,4.280000e+08,5.310000e+08
Capital Surplus,5.180000e+08,5.180000e+08,5.180000e+08,5.180000e+08
Total Liab,5.332200e+10,5.355800e+10,4.903700e+10,5.132300e+10
Total Stockholder Equity,5.126400e+10,4.786500e+10,4.724000e+10,5.559200e+10
Minority Interest,4.341000e+09,4.310000e+09,4.584000e+09,5.078000e+09

In [73]:
# BHP quarterly balance sheet
BHP_quarterly_balance_sheet = BHP.quarterly_balance_sheet
BHP_quarterly_balance_sheet.head()

,2021-06-30,2021-03-31,2020-12-31,2020-09-30
Intangible Assets,2.400000e+08,2.400000e+08,1.508000e+09,1.508000e+09
Capital Surplus,5.180000e+08,5.180000e+08,NaN,NaN
Total Liab,5.332200e+10,5.332200e+10,4.981000e+10,4.981000e+10
Total Stockholder Equity,5.126400e+10,5.126400e+10,4.892200e+10,4.892200e+10
Minority Interest,4.341000e+09,4.341000e+09,4.501000e+09,4.501000e+09

In [74]:
# BHP earnings 
BHP_earnings = FB.earnings
BHP_earnings.head()

           Revenue     Earnings
Year
2018   55838000000  22112000000
2019   70697000000  18485000000
2020   85965000000  29146000000
2021  117929000000  39370000000

In [75]:
# Download BHP Dataframe 
data_BHP = yf.download("BHP", period="max")
data_BHP.head()

[*********************100%***********************]  1 of 1 completed

            Open      High       Low     Close  Adj Close  Volume
Date
1980-03-17   0.0  3.207081  3.144807  3.144807   0.769394   45766
1980-03-18   0.0  3.238217  3.175944  3.175944   0.777012   22080
1980-03-19   0.0  3.425038  3.362764  3.362764   0.822718    9635
1980-03-20   0.0  3.393901  3.331628  3.331628   0.815100   98758
1980-03-21   0.0  3.269354  3.207081  3.207081   0.784629   74269

In [76]:
# Ethical investing - BHP
BHP_sustainability = TSLA.sustainability
BHP_sustainability.head(15)

                       Value
2022-2
palmOil                False
controversialWeapons   False
gambling               False
socialScore            16.16
nuclear                False
furLeather             False
alcoholic              False
gmo                    False
catholic               False
socialPercentile        None
peerCount                 37
governanceScore         9.61
environmentPercentile   None
animalTesting          False
tobacco                False

In [77]:
# Broker Recommendation 
BHP_recommendations = BHP.recommendations
BHP_recommendations.head()

                                  Firm      To Grade  From Grade Action
Date
2012-10-11 09:36:00  Canaccord Genuity          Hold         Buy   down
2013-01-10 14:02:31    Bank of America  Underperform     Neutral   down
2013-01-11 08:16:19          Macquarie       Neutral  Outperform   down
2013-01-15 07:04:42       Dahlman Rose          Hold         Buy   down
2013-01-23 06:34:54          Citigroup       Neutral         Buy   down

In [78]:
# NAB
# Historical stock data
hist_NAB = NAB.history(period="max")
hist_NAB.head()

,Open,High,Low,Close,Volume,Dividends,Stock Splits
Date,,,,,,,
2016-01-27,17.299999,17.299999,17.184999,17.184999,0,0,0
2016-07-25,1.070000,1.070000,1.070000,1.070000,0,0,0
2016-07-26,1.070000,1.070000,1.070000,1.070000,0,0,0
2016-07-27,1.070000,1.070000,1.070000,1.070000,910,0,0
2016-07-28,1.070000,1.070000,1.070000,1.070000,0,0,0

In [79]:
# Fiancial information - Facebook
NAB_financials = NAB.financials
NAB_financials.head()

Empty DataFrame
Columns: [Open, High, Low, Close, Adj Close, Volume]
Index: []

In [80]:
# Quarterly financial information - Facebook
NAB_quarterly_financials = NAB.quarterly_financials
NAB_quarterly_financials.head()

Empty DataFrame
Columns: [Open, High, Low, Close, Adj Close, Volume]
Index: []

In [81]:
# Balance sheet
NAB_balance_sheet = NAB.balance_sheet
NAB.balance_sheet.head()

Empty DataFrame
Columns: [Open, High, Low, Close, Adj Close, Volume]
Index: []

In [82]:
# Quarterly balance sheet
NAB_quarterly_balance_sheet = NAB.quarterly_balance_sheet
NAB_quarterly_balance_sheet.head()

Empty DataFrame
Columns: [Open, High, Low, Close, Adj Close, Volume]
Index: []

In [83]:
# GOOGL earnings 
NAB_earnings = NAB.earnings
NAB_earnings.head()

Empty DataFrame
Columns: [Open, High, Low, Close, Adj Close, Volume]
Index: []

In [84]:
# Identify shareholders
NAB_shareholders = NAB.major_holders
NAB_shareholders.head()

                     0   1
0       Previous Close NaN
1           YTD Return NaN
2  Expense Ratio (net) NaN
3             Category NaN
4        Last Cap Gain NaN

In [85]:
# Download NAB Dataframe 
data_NAB = yf.download("NAB", period="max")
data_NAB.head()

[*********************100%***********************]  1 of 1 completed

                 Open       High        Low      Close  Adj Close  Volume
Date
2016-01-27  17.299999  17.299999  17.184999  17.184999  17.184999       0
2016-07-25   1.070000   1.070000   1.070000   1.070000   1.070000       0
2016-07-26   1.070000   1.070000   1.070000   1.070000   1.070000       0
2016-07-27   1.070000   1.070000   1.070000   1.070000   1.070000     910
2016-07-28   1.070000   1.070000   1.070000   1.070000   1.070000       0

In [90]:
# Ethical investing - NAB
NAB_sustainability = NAB.sustainability
NAB_sustainability.head()

AttributeError: 'NoneType' object has no attribute 'head'

In [91]:
# Broker Recommendation 
NAB_recommendations = NAB.recommendations
NAB_recommendations.head()

AttributeError: 'NoneType' object has no attribute 'head'

In [ ]:
# ANZ

In [92]:
# Fiancial information - ANZ
ANZ_financials = ANZ.financials
ANZ_financials.head()

Empty DataFrame
Columns: [Open, High, Low, Close, Adj Close, Volume]
Index: []

In [93]:
# Quarterly financial information - Facebook
ANZ_quarterly_financials = ANZ.quarterly_financials
ANZ_quarterly_financials.head()

Empty DataFrame
Columns: [Open, High, Low, Close, Adj Close, Volume]
Index: []

In [ ]:
# Balance sheet - Facebook
ANZ_balance_sheet = ANZ.balance_sheet
ANZ.balance_sheet.head()

In [94]:
# ANZ quarterly balance sheet
ANZ_quarterly_balance_sheet = ANZ.quarterly_balance_sheet
ANZ_quarterly_balance_sheet.head()

Empty DataFrame
Columns: [Open, High, Low, Close, Adj Close, Volume]
Index: []

In [95]:
# ANZ earnings 
ANZ_earnings = FB.earnings
ANZ_earnings.head()

           Revenue     Earnings
Year
2018   55838000000  22112000000
2019   70697000000  18485000000
2020   85965000000  29146000000
2021  117929000000  39370000000

In [96]:
# Download ANZ Dataframe 
data_ANZ = yf.download("ANZ", period="max")
data_ANZ.head()

[*********************100%***********************]  1 of 1 completed

                 Open       High        Low      Close  Adj Close  Volume
Date
2000-01-03  24.000000  24.000000  24.000000  24.000000  24.000000       0
2000-01-04  22.500000  22.500000  22.500000  22.500000  22.500000       0
2000-01-05  22.799999  22.799999  22.799999  22.799999  22.799999       0
2000-01-06  22.900000  22.900000  22.900000  22.900000  22.900000       0
2000-01-07  23.000000  23.000000  23.000000  23.000000  23.000000       0

In [98]:
# Ethical investing - ANZ
ANZ_sustainability = TSLA.sustainability
ANZ_sustainability.head(15)

                       Value
2022-2
palmOil                False
controversialWeapons   False
gambling               False
socialScore            16.16
nuclear                False
furLeather             False
alcoholic              False
gmo                    False
catholic               False
socialPercentile        None
peerCount                 37
governanceScore         9.61
environmentPercentile   None
animalTesting          False
tobacco                False

In [99]:
# Broker Recommendation 
ANZ_recommendations = ANZ.recommendations
ANZ_recommendations.head()

AttributeError: 'NoneType' object has no attribute 'head'